Revit 2026 API

# InsulationTypeSetErase Method

---

Removes a specified insulation type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	InsulationType item
)
```
```vb
Public Overridable Function Erase (
	item As InsulationType
) As Integer
```
```cpp
public:
virtual int Erase(
	InsulationType^ item
)
```
```fsharp
abstract Erase :
        item : InsulationType -> int
override Erase :
        item : InsulationType -> int
```

#### Parameters

item InsulationType
    The insulation type to be erased.

#### Return Value

Int32The number of insulation types that were erased from the set.

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace